// 参考视频:https://www.bilibili.com/video/BV1Sepyz7ECL/
// ?spm_id_from=333.337.search-card.all.click&vd_source=2df38eb18d0383a8d619977c0e144fd6

#include "memory_sector.hpp"
#include <print>
#include <vector>

int a = 10; //.data段中
int b;      // 未初始化的全局变量, 在静态内存分区的.bss段中
int c{};    // 零初始化的全局变量, 在静态内存分区的.bss段中

static int d = 20; // 静态内存分区, 在.data段中

void say_hello() {
    std::println("a = {}, b = {}, c = {}, d = {}", a, b, c, d);
    std::print("Hello, world!\n");
}

void demo_memory_sector() {
    int x = 10;           // 栈内存, 局部变量
    static double e = 1;  // 静态内存分区, 在.data段中
    static float f{};     // 零初始化的静态变量, 在.bss段中
    std::vector<int> v{}; // 零初始化的动态数组, 在堆内存中
    say_hello();
}

/*
内存模型: 非32位系统的内存模型
------------(高地址)---------
动态内存区(栈stack/共享库/堆heap)
############################
静态内存区(.rodata/.data/.bss)
############################
代码区(.text)---机器码表示
------------(低地址)---------
*/

/* 具体版本
内存模型: 非32位系统的内存模型
------------(高地址)---------%%%%%%%%%%%%%%%%%%%%%
                ^           %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
            (heap)          %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
****************************%%%%%%%%%%%%%%%%%%%%%
        代码共享库           %%%%%%Run-time%%%%%%%
****************************%%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
            (stack)         %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
                |           %%%%%%%%%%%%%%%%%%%%%
                ↓           %%%%%%%%%%%%%%%%%%%%%
##########动静分割###########$$$$$$$$$$$$$$$$$$$$$
静态内存区(.rodata/.data/.bss)$   build-time    $$$
############################ $$$$$$$$$$$$$$$$$$$$$
代码区(.text)---机器码表示    $$$$$$$$$$$$$$$$$$$$$
------------(低地址)---------$$$$$$$$$$$$$$$$$$$$$$
 */